{
  "posts": [
    {
      "id": "1",
      "title": "Getting Started with Next.js",
      "image": "/uploads/blog-images/1768987464459-blog-default.png",
      "category": "Next.js",
      "content": "Next.js is a powerful React framework that enables server-side rendering, static site generation, and API routes. This guide helps beginners understand the basics and set up their first project step by step."
    },
    {
      "title": "Understanding React Hooks",
      "image": "/uploads/blog-images/1769512726086-banner.webp",
      "category": "React",
      "content": "React Hooks allow you to use state and other React features without writing a class. Hooks like useState, useEffect, and useContext simplify logic and improve code readability.",
      "id": "2"
    },
    {
      "title": "Dark Mode in Modern Web Apps",
      "image": "/uploads/blog-images/1769512784921-banner1.jpg",
      "category": "UI/UX",
      "content": "Dark mode has become a standard feature in modern applications. This article explains how to implement dark mode using CSS variables, prefers-color-scheme, and JavaScript toggles.",
      "id": "3"
    },
    {
      "title": "Optimizing Web Performance",
      "image": "/uploads/blog-images/1769512742622-banner2.jpg",
      "category": "Performance",
      "content": "Performance optimization improves user experience and SEO. Learn about code splitting, lazy loading, image optimization, and best practices to make your website blazing fast.",
      "id": "4"
    },
    {
      "title": "JavaScript ES6 Features You Should Know",
      "image": "/uploads/blog-images/1769512764203-banner3.jpg",
      "category": "JavaScript",
      "content": "ES6 introduced powerful features like arrow functions, destructuring, template literals, and modules. These features make JavaScript cleaner, more expressive, and easier to maintain.",
      "id": "5"
    },
    {
      "title": "Building Responsive Layouts with CSS Grid",
      "image": "/uploads/blog-images/1769512775428-banner.webp",
      "category": "CSS",
      "content": "CSS Grid is a two-dimensional layout system that makes building responsive designs simple. This guide walks through grid concepts, examples, and real-world layout patterns.",
      "id": "6"
    },
    {
      "id": "7",
      "title": "API Integration Basics for Frontend Developers",
      "image": "/uploads/blog-images/1768987464459-blog-default.png",
      "category": "APIs",
      "content": "APIs allow frontend applications to communicate with servers. Learn how to fetch data using REST APIs, handle errors, and manage loading states effectively."
    },
    {
      "title": "Deploying Your App to Production",
      "image": "/uploads/blog-images/1768987464459-blog-default.png",
      "category": "DevOps",
      "content": "Deployment is the final step in building an application. This article covers deployment strategies, environment variables, and tips for deploying apps smoothly to production.aaaaaaaaaaa",
      "id": "8"
    }
  ]
}